In [3]:
#standard ds libraries
import pandas as pd
import numpy as np

# my acquire and prepare file
import acquire
import prepare

#env file to import datasets
import env

# import splitting functions
from sklearn.model_selection import train_test_split

### 1. Attendance Data

Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [4]:
DB_URL = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/tidy_data'

In [7]:
attendance = pd.read_sql('SELECT * FROM attendance', DB_URL)
attendance

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P